app/controllers/users_controller.rb

UPDATE "users" SET "name" = $1, "occupation" = $2, "street_address" = $3, "city" = $4, "state" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["name", ""], ["occupation", ""], ["street_address", "12344 nw 89 st"], ["city", "miami"], ["state", ""], ["updated_at", 2017-04-22 19:38:14 UTC], ["id", 7]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)